workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-create-asset-cpu1-hey.txt

Summary:
  Total:	15.6809 secs
  Slowest:	0.0693 secs
  Fastest:	0.0004 secs
  Average:	0.0313 secs
  Requests/sec:	6377.1683
  
  Total data:	5400000 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.007 [14]	|
  0.014 [99]	|
  0.021 [133]	|
  0.028 [7092]	|■■■■
  0.035 [67718]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [24530]	|■■■■■■■■■■■■■■
  0.049 [248]	|
  0.056 [105]	|
  0.062 [57]	|
  0.069 [3]	|


Latency distribution:
  10%% in 0.0281 secs
  25%% in 0.0287 secs
  50%% in 0.0297 secs
  75%% in 0.0349 secs
  90%% in 0.0369 secs
  95%% in 0.0375 secs
  99%% in 0.0389 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0057 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0040 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0039 secs
  resp wait:	0.0313 secs, 0.0004 secs, 0.0693 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [500]	100000 responses