workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-create-asset-cpu2-hey.txt

Summary:
  Total:	8.0215 secs
  Slowest:	0.1246 secs
  Fastest:	0.0003 secs
  Average:	0.0160 secs
  Requests/sec:	12466.5671
  
  Total data:	5400000 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [2837]	|■
  0.025 [95158]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.038 [1422]	|■
  0.050 [371]	|
  0.062 [156]	|
  0.075 [41]	|
  0.087 [9]	|
  0.100 [1]	|
  0.112 [1]	|
  0.125 [3]	|


Latency distribution:
  10%% in 0.0137 secs
  25%% in 0.0143 secs
  50%% in 0.0150 secs
  75%% in 0.0166 secs
  90%% in 0.0195 secs
  95%% in 0.0208 secs
  99%% in 0.0321 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0085 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0038 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0159 secs, 0.0003 secs, 0.1245 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0012 secs

Status code distribution:
  [500]	100000 responses