workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-create-asset-cpu4-hey.txt

Summary:
  Total:	6.6821 secs
  Slowest:	0.6480 secs
  Fastest:	0.0003 secs
  Average:	0.0129 secs
  Requests/sec:	14965.3069
  
  Total data:	5400000 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.065 [97202]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.130 [2102]	|■
  0.195 [440]	|
  0.259 [119]	|
  0.324 [60]	|
  0.389 [35]	|
  0.454 [19]	|
  0.518 [15]	|
  0.583 [6]	|
  0.648 [1]	|


Latency distribution:
  10%% in 0.0051 secs
  25%% in 0.0055 secs
  50%% in 0.0063 secs
  75%% in 0.0101 secs
  90%% in 0.0245 secs
  95%% in 0.0442 secs
  99%% in 0.1114 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0056 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0052 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0032 secs
  resp wait:	0.0129 secs, 0.0003 secs, 0.6479 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0032 secs

Status code distribution:
  [500]	100000 responses