workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-create-asset-cpu8-hey.txt

Summary:
  Total:	6.6159 secs
  Slowest:	0.5925 secs
  Fastest:	0.0003 secs
  Average:	0.0129 secs
  Requests/sec:	15114.9907
  
  Total data:	5400000 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.059 [96720]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.119 [2446]	|■
  0.178 [494]	|
  0.237 [170]	|
  0.296 [74]	|
  0.356 [44]	|
  0.415 [24]	|
  0.474 [14]	|
  0.533 [6]	|
  0.592 [7]	|


Latency distribution:
  10%% in 0.0050 secs
  25%% in 0.0054 secs
  50%% in 0.0062 secs
  75%% in 0.0102 secs
  90%% in 0.0243 secs
  95%% in 0.0446 secs
  99%% in 0.1086 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0014 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0009 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0109 secs
  resp wait:	0.0128 secs, 0.0003 secs, 0.5924 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0099 secs

Status code distribution:
  [500]	100000 responses