workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-asset-cpu1-hey.txt

Summary:
  Total:	200.9581 secs
  Slowest:	0.0566 secs
  Fastest:	0.0003 secs
  Average:	0.0402 secs
  Requests/sec:	4976.1609
  
  Total data:	639000000 bytes
  Size/request:	639 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [5]	|
  0.012 [15]	|
  0.017 [24]	|
  0.023 [21]	|
  0.028 [42]	|
  0.034 [749]	|
  0.040 [491795]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [486228]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.051 [21089]	|■■
  0.057 [31]	|


Latency distribution:
  10%% in 0.0361 secs
  25%% in 0.0372 secs
  50%% in 0.0400 secs
  75%% in 0.0432 secs
  90%% in 0.0443 secs
  95%% in 0.0448 secs
  99%% in 0.0457 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0049 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0027 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.0402 secs, 0.0003 secs, 0.0547 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	1000000 responses