workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-asset-cpu2-hey.txt

Summary:
  Total:	98.7177 secs
  Slowest:	0.0570 secs
  Fastest:	0.0003 secs
  Average:	0.0197 secs
  Requests/sec:	10129.8956
  
  Total data:	639000000 bytes
  Size/request:	639 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [115]	|
  0.012 [146]	|
  0.017 [116749]	|■■■■■■
  0.023 [762664]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [119022]	|■■■■■■
  0.034 [1155]	|
  0.040 [36]	|
  0.046 [50]	|
  0.051 [58]	|
  0.057 [4]	|


Latency distribution:
  10%% in 0.0172 secs
  25%% in 0.0179 secs
  50%% in 0.0189 secs
  75%% in 0.0217 secs
  90%% in 0.0233 secs
  95%% in 0.0242 secs
  99%% in 0.0263 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0082 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0078 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0095 secs
  resp wait:	0.0197 secs, 0.0003 secs, 0.0463 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [200]	1000000 responses