workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-asset-cpu8-hey.txt

Summary:
  Total:	32.2764 secs
  Slowest:	0.0926 secs
  Fastest:	0.0003 secs
  Average:	0.0064 secs
  Requests/sec:	30982.4076
  
  Total data:	639000000 bytes
  Size/request:	639 bytes

Response time histogram:
  0.000 [1]	|
  0.010 [943718]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [52348]	|■■
  0.028 [1636]	|
  0.037 [826]	|
  0.046 [595]	|
  0.056 [424]	|
  0.065 [244]	|
  0.074 [134]	|
  0.083 [58]	|
  0.093 [16]	|


Latency distribution:
  10%% in 0.0043 secs
  25%% in 0.0051 secs
  50%% in 0.0061 secs
  75%% in 0.0073 secs
  90%% in 0.0086 secs
  95%% in 0.0097 secs
  99%% in 0.0133 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0061 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0053 secs
  resp wait:	0.0064 secs, 0.0003 secs, 0.0923 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0103 secs

Status code distribution:
  [200]	1000000 responses