workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-template-cpu16-hey.txt

Summary:
  Total:	23.0259 secs
  Slowest:	0.1036 secs
  Fastest:	0.0002 secs
  Average:	0.0046 secs
  Requests/sec:	43429.4055
  
  Total data:	798000000 bytes
  Size/request:	798 bytes

Response time histogram:
  0.000 [1]	|
  0.011 [991881]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.021 [5723]	|
  0.031 [952]	|
  0.042 [714]	|
  0.052 [419]	|
  0.062 [190]	|
  0.073 [84]	|
  0.083 [18]	|
  0.093 [13]	|
  0.104 [5]	|


Latency distribution:
  10%% in 0.0027 secs
  25%% in 0.0034 secs
  50%% in 0.0043 secs
  75%% in 0.0053 secs
  90%% in 0.0066 secs
  95%% in 0.0075 secs
  99%% in 0.0101 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0084 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0081 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0045 secs, 0.0002 secs, 0.1034 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [200]	1000000 responses