workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-template-cpu2-hey.txt

Summary:
  Total:	72.2791 secs
  Slowest:	0.0329 secs
  Fastest:	0.0002 secs
  Average:	0.0144 secs
  Requests/sec:	13835.2584
  
  Total data:	798000000 bytes
  Size/request:	798 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [99]	|
  0.007 [159]	|
  0.010 [311]	|
  0.013 [306205]	|■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [515555]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.020 [161635]	|■■■■■■■■■■■■■
  0.023 [15343]	|■
  0.026 [480]	|
  0.030 [36]	|
  0.033 [176]	|


Latency distribution:
  10%% in 0.0127 secs
  25%% in 0.0131 secs
  50%% in 0.0138 secs
  75%% in 0.0150 secs
  90%% in 0.0177 secs
  95%% in 0.0185 secs
  99%% in 0.0203 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:	0.0144 secs, 0.0002 secs, 0.0328 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	1000000 responses