workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-template-cpu4-hey.txt

Summary:
  Total:	35.9992 secs
  Slowest:	0.0387 secs
  Fastest:	0.0002 secs
  Average:	0.0072 secs
  Requests/sec:	27778.3633
  
  Total data:	798000000 bytes
  Size/request:	798 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [914]	|
  0.008 [783438]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [210811]	|■■■■■■■■■■■
  0.016 [4664]	|
  0.019 [63]	|
  0.023 [39]	|
  0.027 [41]	|
  0.031 [8]	|
  0.035 [7]	|
  0.039 [14]	|


Latency distribution:
  10%% in 0.0059 secs
  25%% in 0.0063 secs
  50%% in 0.0070 secs
  75%% in 0.0077 secs
  90%% in 0.0089 secs
  95%% in 0.0097 secs
  99%% in 0.0112 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0050 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.0072 secs, 0.0002 secs, 0.0341 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [200]	1000000 responses