workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-get-template-cpu8-hey.txt

Summary:
  Total:	22.4215 secs
  Slowest:	0.0930 secs
  Fastest:	0.0002 secs
  Average:	0.0045 secs
  Requests/sec:	44600.1309
  
  Total data:	798000000 bytes
  Size/request:	798 bytes

Response time histogram:
  0.000 [1]	|
  0.009 [985810]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [10942]	|
  0.028 [1523]	|
  0.037 [857]	|
  0.047 [548]	|
  0.056 [213]	|
  0.065 [85]	|
  0.074 [14]	|
  0.084 [4]	|
  0.093 [3]	|


Latency distribution:
  10%% in 0.0027 secs
  25%% in 0.0033 secs
  50%% in 0.0041 secs
  75%% in 0.0051 secs
  90%% in 0.0063 secs
  95%% in 0.0072 secs
  99%% in 0.0105 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0055 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0044 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0130 secs
  resp wait:	0.0044 secs, 0.0002 secs, 0.0922 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0210 secs

Status code distribution:
  [200]	1000000 responses